ikorana/dali-ana-kutu02-esp32/main/main.cpp
#include <stdio.h>
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "driver/gpio.h"
#include "esp_system.h"
#include "nvs_flash.h"
#include "nvs.h"
#include "esp_event.h"
#include "time.h"

#include <vector>


#define STM_TX GPIO_NUM_33 //STM32ye baglanan UART
#define STM_RX GPIO_NUM_32 //STM32ye baglanan UART 
#define STM_RESET GPIO_NUM_15 //STM32 Resetleme Ucu

#define STM_PING GPIO_NUM_25 //BU HAT NORMALDE 1 DE DURACAK
#define STM_PONG GPIO_NUM_26 //BU HAT NORMALDE 1 DE DURACAK

//STMDE PB12 İNPUT OLACAK PİNG BURADAN GELECEK
//PB11 DEN CEVAP VERECEK 


#define CAN_D GPIO_NUM_17 //Can Bus  
#define CAN_R GPIO_NUM_13 //Can Bus

#define LED GPIO_NUM_0


#define BIT_START    (1 << 0)
#define BIT_CONTINUE (1 << 1)
#define BIT_STOP     (1 << 2)

EventGroupHandle_t searchGROUP = xEventGroupCreate();
class Base_Event;
std::vector<Base_Event *> event_list; 
typedef struct {
    struct tm timeinfo;
    struct tm sunrise;
    struct tm sunset; 
    uint8_t haftanin_gunu;
    uint8_t yilin_haftasi;
    uint16_t yilin_gunu;
} tarih_saat_t;

tarih_saat_t tarih_saat = {};

typedef struct {
    uint8_t komut;
    uint8_t altkomut;
    uint8_t index;
    uint8_t location;
    uint8_t room;
    // "refresh" gibi kendi taraması arka planda süren, henüz bitmemiş
    // komutlar için true — firebase_voice_task "Komutunuz uygulandı"
    // yerine kısa bir "bekleyiniz" mesajı söyler, sonucun (say ile) erken
    // gelen asıl özetle çakışmaması için.
    bool devam_ediyor;
} voice_sonuc_t;

QueueHandle_t xvoiceQueue = NULL;

#include "tools/dali_command.h"

#include "core.h"
#include "storage_little.h"
#include "eth5500.h"
#include "wifista.h"
#include "wifiAP.h"
#include "iptool.h"
#include "esp_sntp.h"
#include "udp_server_gem.h"
#include "esp32Time.h"

#include "http.h"
#include "esp_ota_ops.h"
#include "tftp_ota_server.h"
#include "tftp_disk_server.h"
#include "mqtt_client.h"
#include "mdns.h"
#include "esp_http_client.h"
#include "esp_tls.h"

#include "tools/Uart.hpp"

void to_lowercase(char *str) {
    while (*str) {
        // Her karakteri sırayla küçük harfe çeviriyoruz
        *str = tolower((unsigned char)*str);
        str++;
    }
}

void ing_yap(const char *src, char *dest) {
    while (*src) {
        // UTF-8'de Türkçe karakterler iki bayt kaplar ve ilk baytları genellikle 0xC3 veya 0xC4'tür.
        if ((unsigned char)*src == 0xC3) {
            src++; // İkinci bayta geç
            switch ((unsigned char)*src) {
                case 0x87: *dest++ = 'C'; break;  // Ç
                case 0xA7: *dest++ = 'c'; break;  // ç
                case 0x96: *dest++ = 'O'; break;  // Ö
                case 0xB6: *dest++ = 'o'; break;  // ö
                case 0x9C: *dest++ = 'U'; break;  // Ü
                case 0xBC: *dest++ = 'u'; break;  // ü
                default:
                    // Eğer eşleşmediyse bozmamak için ilk baytı ve bu baytı aynen yaz
                    *dest++ = 0xC3; 
                    *dest++ = *src; 
                    break;
            }
        } 
        else if ((unsigned char)*src == 0xC4) {
            src++; // İkinci bayta geç
            switch ((unsigned char)*src) {
                case 0x9E: *dest++ = 'G'; break;  // Ğ
                case 0x9F: *dest++ = 'g'; break;  // ğ
                case 0xB0: *dest++ = 'I'; break;  // İ (UTF-8'de büyük İ harfi C4 B0'dır)
                case 0xB1: *dest++ = 'i'; break;  // ı
                default: 
                    *dest++ = 0xC4; 
                    *dest++ = *src; 
                    break;
            }
        } 
        else if ((unsigned char)*src == 0xC5) {
            src++; // İkinci bayta geç
            switch ((unsigned char)*src) {
                case 0x9E: *dest++ = 'S'; break;  // Ş
                case 0x9F: *dest++ = 's'; break;  // ş
                default: 
                    *dest++ = 0xC5; 
                    *dest++ = *src; 
                    break;
            }
        } 
        else {
            // Standart ASCII karakteri (İngilizce harfler, sayılar vb. direkt kopyala)
            *dest++ = *src;
        }
        src++;
    }
    *dest = '\0'; // String sonlandırıcıyı ekle
}


void mqtt_send(const char *data);
QueueHandle_t IntQueue = xQueueCreate(5, sizeof(uint32_t));

typedef void (*base_callback_t)(void *fnc, uint8_t id, const char* txt);
typedef void (*base_say_callback_t)(void *fnc, uint8_t id, const char* txt);
typedef void (*send_events_t)(cJSON *par);
void send_events(cJSON *pay); 


#include "tools/room/room.h"
#include "tools/switch/switch.h"
#include "tools/gurup/gurup.h"
#include "tools/instance/instance.h"
#include "tools/gear/gear.h"
#include "tools/fcm/fcm.h"
#include "tools/base/base.h"
#include "tools/base/relay.h"
#include "tools/base/energy.h"
#include "tools/base/elevator.h"
#include "tools/base/gas.h"
#include "tools/base/blind.h"
#include "tools/base/water.h"
#include "tools/base/priz.h"
#include "tools/base/mwater.h"
#include "tools/base/door.h"
#include "tools/base/garage.h"
#include "tools/base/relaylamp.h"
#include "tools/base/movement.h"

#include "tools/base/irrigation.h"

std::vector<Base_Device*> cihaz_listesi;

// Global ReliableUartManager instance
ReliableUartManager reliableUartManager;

Irrigation *irrigation = nullptr;


void temp_role_degerlendir(instance_t *ins);
void send_wifi(cJSON *pay);
void base_function_callback(void *fnc, uint8_t id, const char *txt);
void base_function_saycallback(void *fnc, uint8_t id, const char *txt);
void send_AK(cJSON *pay, pck_t *pck, bool is_mqtt=false);
static void voice_parse_task(void *args);
static void new_voice_parse_task(void *args);
uint8_t find_devicename(std::vector<find_param_t> lst, char *txt);
static int apply_category_fanout(uint8_t ext_type_beklenen, uint8_t oda_index,
                                  altkomuttipi_t altkomut, uint8_t guc_yuzde, uint8_t guc_seviyesi,
                                  pck_t *pck, bool is_mqtt);
static bool apply_named_device_command(const char *search_text, altkomuttipi_t altkomut,
                                        uint8_t guc_yuzde, uint8_t guc_seviyesi,
                                        pck_t *pck, bool is_mqtt);

