ikorana/dali-ana-kutu02-esp32/main/main.cpp
typedef struct {
    uint8_t addr;
    uint8_t type;
    uint8_t exttype;
    uint8_t name[32];
} searchMessage_t;

// Kuyruk tutucu (handle)
QueueHandle_t searchQueue = xQueueCreate(5, sizeof(searchMessage_t));
QueueHandle_t wsearchQueue = xQueueCreate(5, sizeof(searchMessage_t));

static uint8_t willTopic[64];
static uint8_t inTopic[64];
static uint8_t outTopic[64];


#include "tools/sound_command.cpp"
#include "tools/define.cpp"
#include "tools/handler.cpp"
#include "tools/udp_events.cpp"
#include "tools/global_tools.cpp"
#include "tools/httpd_events.cpp"
#include "tools/mqtt_tool.cpp"
#include "tools/connection.cpp"
#include "tools/voice.cpp"

typedef struct {
    uint32_t addr     : 8;
    uint32_t instance : 6;
    uint32_t event    : 10;
    uint32_t reserved : 8;
} EventData_t;

typedef union {
    EventData_t alan;        // Bit alanları olarak
    uint32_t  value;         // 32-bit değer olarak
    uint8_t   by[4];      // 4 byte olarak
} EventDataUnion_t;

typedef struct {
   uint8_t adr;
   uint8_t ins;
   uint8_t ev;
} event_proc_par_t;

static bool stm_send_status = false;


void base_function_saycallback(void *fnc, uint8_t id, const char *txt) {

   // Base_Device *dev = (Base_Device *)fnc;

    cJSON *root = cJSON_CreateObject();
    cJSON_AddStringToObject(root, "com","say");
    cJSON_AddStringToObject(root, "txt", txt);
    char *dat = cJSON_PrintUnformatted(root);
    udp_server.send_unicast_all((uint8_t *)dat,strlen(dat));
   // printf("%s\n",dat);
    cJSON_free(dat);
    cJSON_Delete(root);
    printf("SAY : %s\n",txt);
}

void base_function_callback(void *fnc, uint8_t id, const char *txt) {
    Base_Device *dev = (Base_Device *)fnc;
    cJSON *root = cJSON_CreateObject();
    cJSON_AddStringToObject(root, "com","get_level");
    cJSON_AddNumberToObject(root, "adres",dev->device_id);
    cJSON_AddNumberToObject(root, "kanal",dev->device_channel);
    cJSON_AddNumberToObject(root, "power",dev->state);
    if (txt!=nullptr) cJSON_AddStringToObject(root, "txt", txt);
    char *dat = cJSON_PrintUnformatted(root);
    udp_server.send_unicast_all((uint8_t *)dat,strlen(dat));
//    printf("%s\n",dat);

    cJSON_free(dat);
    cJSON_Delete(root);
    //printf("Mesaj Geldi %s State:%d ID:%d\n",dev->name,dev->state,id);
}

void lamp_action(uint8_t adr, uint8_t grp, uint8_t cmd, uint8_t chn)
{
        uint32_t cmm = create_command(adr,(grp==0)?false:true,false,cmd);
        cJSON *root = cJSON_CreateObject();
        cJSON_AddStringToObject(root, "com", "send");
        cJSON_AddNumberToObject(root, "hexcom", cmm);
        cJSON_AddNumberToObject(root, "kanal",chn);
        cJSON_AddNumberToObject(root, "bit",16);
        send_STM(root);
        cJSON_Delete(root);
}

void event_process_task(void *pvParameters) 
{
   event_proc_par_t *param = (event_proc_par_t *)pvParameters;
   printf("TUS basıldı %d %d %d\n", param->adr,param->ins,param->ev);
   static instance_t ins = {};
   instance.get_instance(param->adr,param->ins, &ins);

    uint8_t aadr = ins.com_addr;
    uint8_t agrp = 0;
    if (ins.com==CM_GROUP) agrp=1; 
    
    if (ins.com==CM_LAMP || ins.com==CM_GROUP)
    {
        if (ins.process==PR_TOGGLE || ins.process==PR_TOGMAX) {
            if (ins.status==0) {
                uint8_t cm = 0x0A;
                if (ins.process==PR_TOGMAX) cm=0x05;
                lamp_action(aadr,agrp,cm,ins.channel);
                ins.status=1;
                printf("TOGGLE ON\n");
            } else {
                lamp_action(aadr,agrp,0x00,ins.channel);
                ins.status=0;
                printf("TOGGLE OFF\n");
            }                       
        } 
        if (ins.process==PR_ON) {
            lamp_action(aadr,agrp,0x0A,ins.channel);
            ins.status=1;
            printf("ON\n");
        }
        if (ins.process==PR_OFF) {
            lamp_action(aadr,agrp,0x00,ins.channel);
            ins.status=0;
            printf("OFF\n");
        }
        if (ins.process==PR_MAXLEVEL) {
            lamp_action(aadr,agrp,0x05,ins.channel);
            ins.status=1;
            printf("MAX LEVEL\n");
        }
        if (ins.process==PR_MINLEVEL) {
            lamp_action(aadr,agrp,0x06,ins.channel);
            ins.status=1;
            printf("MIN LEVEL\n");
        }

        if (ins.process==PR_UPDIM) {
            lamp_action(aadr,agrp,0x08,ins.channel);
            ins.status=1;
            printf("ON AND UP\n");
        }
        if (ins.process==PR_DOWNDIM) {
            lamp_action(aadr,agrp,0x07,ins.channel);
            ins.status=1;
            printf("DOWN AND OFF\n");
        }
        
        instance.set_instance(param->adr,param->ins,&ins);
    }
//   printf("INS : %d:%d %d Stat:%d\n",ins.dev_addr,ins.ins_addr, ins.type, ins.status);
   vTaskDelete(NULL);
}



void process_and_control_task(void *pvParameters) 
{
   instance_t *param = (instance_t *)pvParameters;
   static instance_t cpins = {};
   memcpy(&cpins, param, sizeof(instance_t));
   bool don = true;
   uint8_t count=0, stat=1;

   do {
        count++;
        if (cpins.status==1) {
                //En yüksekte AÇ (Max Level)
                lamp_action(cpins.com_addr,0,0x05,cpins.lamp_channel);
            } else {
                //Kapat 
                lamp_action(cpins.com_addr,0,0x00,cpins.lamp_channel);
            }

        vTaskDelay(500/portTICK_PERIOD_MS);
        //process gönderildi durum sorgulanacak
        
        cJSON *pay = cJSON_CreateObject();  
        cJSON_AddStringToObject(pay, "com", "query");
        cJSON_AddNumberToObject(pay, "hexcom", create_command(cpins.com_addr,false,false,QUERY_STATUS));
        cJSON_AddNumberToObject(pay, "kanal",cpins.lamp_channel);
        cJSON_AddNumberToObject(pay, "bit",16);
        send_STM(pay);
        cJSON_Delete(pay);

        //Açma veya kapatma emrinden sonra cihazın statusunda lampon parametresi 1 veya 0 olmalı 
        searchMessage_t msg = {};
        xQueueReset(searchQueue);
        xQueueReceive(searchQueue, &msg, pdMS_TO_TICKS(3000));
        if (count>3) {don=false;stat=0;}
        //Eger 
        if (cpins.status==1) {if ((msg.name[0]&0x04)==0x04) don=false;}
        if (cpins.status==0) {if ((msg.name[0]&0x04)!=0x04) don=false;}
   } while (don);
    
