ikorana/dali-ana-kutu02-esp32/main/main.cpp
   if (stat==0) {
      cpins.status=0;
      instance.set_instance(cpins.dev_addr,cpins.ins_addr,&cpins);
   }

    cJSON *root = cJSON_CreateObject();                      
    cJSON_AddStringToObject(root, "com", "push_temp");
    cJSON_AddNumberToObject(root, "adres", (cpins.dev_addr)); 
    cJSON_AddNumberToObject(root, "ins", (cpins.ins_addr)); 
    cJSON_AddNumberToObject(root, "temp", cpins.temp);
    cJSON_AddNumberToObject(root, "relay", cpins.status);
    cJSON_AddNumberToObject(root, "set", cpins.temp_set);
    cJSON_AddNumberToObject(root, "error", 0);
    cJSON_AddNumberToObject(root, "type", cpins.temp_type);
    char *dat = cJSON_PrintUnformatted(root);
    if (cpins.temp>0) {
        udp_server.send_broadcast((uint8_t *)dat,strlen(dat));
        udp_server.send_unicast_all((uint8_t *)dat,strlen(dat));
        mqtt_send(dat);
    }
    cJSON_free(dat);
    cJSON_Delete(root);

   vTaskDelete(NULL);
}   

void temp_role_degerlendir(instance_t *ins) {

    if (ins->temp_type==0) {
        //ISITMA
       if (ins->temp>=ins->temp_set) ins->status=0; else ins->status=1;
    } else if (ins->temp_type==1) {
        //SOGUTMA
       if (ins->temp<=ins->temp_set) ins->status=1; else ins->status=0; 
    } else if (ins->temp_type==2) {
       //MANUEL ON 
       //33 dereceye kadar durmadan ısıtır
       if (ins->temp>=33) ins->status=0; else ins->status=1;
    } else {
       //MANUEL OFF
       ins->status=0;
    }

    xTaskCreatePinnedToCore(
                        process_and_control_task,           // Task fonksiyonunun adı
                        "pevptask",          // Task'ın ismi (debug için)
                        4096,               // Stack büyüklüğü artırıldı
                        ins,               // Task'a kopyalanan parametre gönderiliyor
                        1,                  // Öncelik sırası (0 en düşük)
                        NULL,               // Task handle (referans gerekmiyorsa NULL)
                        1                   // Çalışacağı çekirdek (0 veya 1)
                    );
  
   //Burada kesin rölenin çekmesi veya bırakması saglanacak
}

void Alarm_Activeted(const char *txt, uint8_t source)
{
    GlobalConfig.alarm_aktif=1;
    disk.write_file(GLOBAL_FILE,&GlobalConfig,sizeof(GlobalConfig),0);
    cJSON *root = cJSON_CreateObject();                      
    cJSON_AddStringToObject(root, "com", "alarm");
    cJSON_AddNumberToObject(root, "status", 1);
    cJSON_AddStringToObject(root, "txt", txt);
    char *dat = cJSON_PrintUnformatted(root);
    udp_server.send_broadcast((uint8_t *)dat,strlen(dat));
    udp_server.send_unicast_all((uint8_t *)dat,strlen(dat));
    mqtt_send(dat);
    cJSON_free(dat);
    cJSON_Delete(root);

    xTaskCreatePinnedToCore(
        firebase_notification_task,           // Task fonksiyonunun adı
        "fntask",          // Task'ın ismi (debug için)
        8192,               // Stack büyüklüğü artırıldı
        (void *)txt,               // Task'a kopyalanan parametre gönderiliyor
        1,                  // Öncelik sırası (0 en düşük)
        NULL,               // Task handle (referans gerekmiyorsa NULL)
        1                   // Çalışacağı çekirdek (0 veya 1)
    );   

    cJSON *pay2 = cJSON_CreateObject(); 
    uint8_t evid = find_event_id("ALARM_STATE_EVENT"); 
    cJSON_AddStringToObject(pay2, "com", "EVENTS");
    cJSON_AddStringToObject(pay2, "event", "ALARM_STATE_EVENT");
    cJSON_AddNumberToObject(pay2, "event_id", evid);
    cJSON_AddNumberToObject(pay2, "source", source);
    cJSON_AddNumberToObject(pay2, "state", 1);
    send_events(pay2);
    cJSON_Delete(pay2);

}


void uartCallback(const uint8_t *data, size_t len)
{
    uint8_t *buf = (uint8_t *)calloc(1,len+1);
    memcpy(buf,data,len);
    buf[len] = '\0';

    buf[strcspn((char*)buf, "\r\n")] = '\0';

    printf("UART GELEN << %s\n",buf);
    
    cJSON *rcv_json = cJSON_Parse((const char *)buf);
    if (rcv_json!=nullptr) {
        char *command = (char *)calloc(1,25);    
        JSON_getstring(rcv_json,"com", command,25);
        //printf("Command : %s\n",command);

        if (strcmp(command, "stm_status") == 0) {
            stm_send_status = true;
        }

        if (strcmp(command, "tus") == 0) {
            int pin = -1, stat = -1;
            if (cJSON_HasObjectItem(rcv_json, "pin")) {
                pin = cJSON_GetObjectItem(rcv_json, "pin")->valueint;
            }
            if (cJSON_HasObjectItem(rcv_json, "stat")) {
                stat = cJSON_GetObjectItem(rcv_json, "stat")->valueint;
            }
            if (pin != -1 && stat != -1) {
                if (GlobalConfig.alarm==2 && GlobalConfig.alarm_aktif==0) Alarm_Activeted("ELEKTRIKSEL FAALİYET ALGILANDI",4);
                for (Base_Device* cihaz : cihaz_listesi) {
                    cihaz->button_process(pin,stat);
                }   
            }
          
        }

        // ReliableUartManager için ACK işleme
        if (strcmp(command, "role") == 0) { // STM32'den gelen onay mesajının "role_resp" olduğu varsayılıyor
            int pin = -1, stat = -1;
            if (cJSON_HasObjectItem(rcv_json, "pin")) {
                pin = cJSON_GetObjectItem(rcv_json, "pin")->valueint;
            }
            if (cJSON_HasObjectItem(rcv_json, "stat")) {
                stat = cJSON_GetObjectItem(rcv_json, "stat")->valueint;
            }
            if (pin != -1 && stat != -1) {
                if (GlobalConfig.alarm==2 && GlobalConfig.alarm_aktif==0) Alarm_Activeted("ELEKTRIKSEL FAALİYET ALGILANDI", 4);
                reliableUartManager.process_response(pin, stat);
            }
        }

        if (strcmp(command,"alarm")==0) {
            uint8_t status=0, sourge=0, aktif = 0;
            char *txt;
            JSON_getint(rcv_json,"status", &status);
            JSON_getint(rcv_json,"sourge",&sourge);
            if (status==1) {
                if (sourge==1) {asprintf(&txt,"YANGIN ALARMI"); aktif=1;}
                if (sourge==2) {asprintf(&txt,"SU BASKINI ALARMI"); aktif=1;}
                if (sourge==3) {asprintf(&txt,"GAZ ALARMI"); aktif=1;}

                if (GlobalConfig.alarm==2) {
                   if (sourge==4) {asprintf(&txt,"ÇEVRESEL HAREKET ALGILANDI"); aktif=1;}
                }
            if (aktif==1) {
                Alarm_Activeted(txt, sourge);
                vTaskDelay(200/portTICK_PERIOD_MS);
                free(txt);                
              }
            }
        }

