ikorana/dali-ana-kutu02-esp32/main/main.cpp
        if (strcmp(command,"log")==0) {
            //udp_server.send_broadcast((uint8_t *)buf,strlen((char*)buf));
            udp_server.send_unicast_all((uint8_t *)buf,strlen((char*)buf));
            //mqtt_send((char*)buf);
        }

        if (strcmp(command,"event")==0) {
            uint32_t data=0;
            JSON_getlong(rcv_json,"data", &data);
            //printf("EVENT : %6lX\n",data);
            EventDataUnion_t ev;
            ev.value = data;

            uint8_t ix = (ev.alan.instance & 0b00100000)>>5; //1 ise tus eventtir
            if (ix==1) ev.alan.instance = ev.alan.instance & 0b00011111;

            
            instance_t ins = {};
            esp_err_t kk= instance.get_instance(ev.alan.addr>>1,ev.alan.instance, &ins);
            printf("Event Adr:%d Ins:%d Event:%d Tus:%d Type:%d\n",ev.alan.addr>>1,ev.alan.instance,ev.alan.event,ix,ins.type);

            //printf("%d:%d %d %s\n",ev.alan.addr>>1,ev.alan.instance,kk,esp_err_to_name(kk));

            if (kk==ESP_OK)
            {
                if (ix==1 && ins.type==0x01) {
                   //Anahtar instance Buna göre işlem yapılacak

                   if (GlobalConfig.alarm==2) {
                        GlobalConfig.alarm_aktif=1;
                        disk.write_file(GLOBAL_FILE,&GlobalConfig,sizeof(GlobalConfig),0);
                        cJSON *root = cJSON_CreateObject();                      
                        cJSON_AddStringToObject(root, "com", "alarm");
                        cJSON_AddNumberToObject(root, "status", 1);
                        cJSON_AddStringToObject(root, "txt", "Hırsızlık Alarmı");
                        char *dat = cJSON_PrintUnformatted(root);
                        udp_server.send_broadcast((uint8_t *)dat,strlen(dat));
                        udp_server.send_unicast_all((uint8_t *)dat,strlen(dat));
                        mqtt_send(dat);
                        cJSON_free(dat);
                        cJSON_Delete(root);
                   }

                   static event_proc_par_t param = {};
                   param.adr = ins.dev_addr;
                   param.ins = ins.ins_addr;
                   param.ev = ev.alan.event;
                   
                   xTaskCreatePinnedToCore(
                        event_process_task,           // Task fonksiyonunun adı
                        "evptask",          // Task'ın ismi (debug için)
                        4096,               // Stack büyüklüğü artırıldı
                        &param,               // Task'a kopyalanan parametre gönderiliyor
                        1,                  // Öncelik sırası (0 en düşük)
                        NULL,               // Task handle (referans gerekmiyorsa NULL)
                        1                   // Çalışacağı çekirdek (0 veya 1)
                    );
                }
                if (ins.type==0x06) {
                    if (ev.alan.event<0x200) {
                        //Isı Sensörü Gelen data ısı datasıdır. 
                        //Sete bakarak röleyi hareket ettir. 
                        //Broadcast olarak Isı datası gönder
                        if (ev.alan.event<2) return;
                        ins.temp = ev.alan.event;                        
                        temp_role_degerlendir(&ins);
                        instance.set_instance(ev.alan.addr>>1,ev.alan.instance,&ins);
                        
                        cJSON *root = cJSON_CreateObject();                      
                        cJSON_AddStringToObject(root, "com", "push_temp");
                        cJSON_AddNumberToObject(root, "adres", (ev.alan.addr>>1)); 
                        cJSON_AddNumberToObject(root, "ins", (ev.alan.instance)); 
                        cJSON_AddNumberToObject(root, "temp", ins.temp);
                        cJSON_AddNumberToObject(root, "relay", ins.status);
                        cJSON_AddNumberToObject(root, "set", ins.temp_set);
                        cJSON_AddNumberToObject(root, "error", 0);
                        cJSON_AddNumberToObject(root, "type", ins.temp_type);
                        char *dat = cJSON_PrintUnformatted(root);
                        //ESP_LOGI("SEND_BR","UDP GIDEN >> %s",dat);
                        if (ins.temp>0) {
                            udp_server.send_broadcast((uint8_t *)dat,strlen(dat));
                            udp_server.send_unicast_all((uint8_t *)dat,strlen(dat));
                            mqtt_send(dat);
                        }
                        cJSON_free(dat);
                        cJSON_Delete(root);
                        return ;
                    }
                    if (ev.alan.event<0x204) {
                        //Sensör arızası
                        cJSON *root = cJSON_CreateObject();                      
                        cJSON_AddStringToObject(root, "com", "push_temp");
                        cJSON_AddNumberToObject(root, "adres", (ev.alan.addr>>1)); 
                        cJSON_AddNumberToObject(root, "ins", (ev.alan.instance)); 
                        cJSON_AddNumberToObject(root, "temp", 0);
                        cJSON_AddNumberToObject(root, "relay", 0);
                        cJSON_AddNumberToObject(root, "set", 0);
                        cJSON_AddNumberToObject(root, "error", 1);
                        char *dat = cJSON_PrintUnformatted(root);
                        ESP_LOGI("SEND_BR","UDP GIDEN >> %s",dat);
                        udp_server.send_broadcast((uint8_t *)dat,strlen(dat));
                        udp_server.send_unicast_all((uint8_t *)dat,strlen(dat));
                        mqtt_send(dat);
                        cJSON_free(dat);
                        cJSON_Delete(root);
                    }                   
                    if (ev.alan.event<0x208) {
                        //sensör resetlenmiş. 
                        cJSON *root = cJSON_CreateObject();                      
                        cJSON_AddStringToObject(root, "com", "push_temp");
                        cJSON_AddNumberToObject(root, "adres", (ev.alan.addr>>1)); 
                        cJSON_AddNumberToObject(root, "ins", (ev.alan.instance)); 
                        cJSON_AddNumberToObject(root, "temp", ev.alan.event);
                        cJSON_AddNumberToObject(root, "relay", ins.status);
                        cJSON_AddNumberToObject(root, "set", ins.temp_set);
                        cJSON_AddNumberToObject(root, "error", 2);
                        char *dat = cJSON_PrintUnformatted(root);
                        ESP_LOGI("SEND_BR","UDP GIDEN >> %s",dat);
                        udp_server.send_broadcast((uint8_t *)dat,strlen(dat));
                        udp_server.send_unicast_all((uint8_t *)dat,strlen(dat));
                        mqtt_send(dat);
                        cJSON_free(dat);
                        cJSON_Delete(root);
                    }
                }
            }

