ikorana/dali-ana-kutu02-esp32/main/main.cpp
        }

        if (strcmp(command,"response")==0) {
            ESP_LOGI("UART","%s",buf);
            searchMessage_t msg = {};
            uint8_t a0=0;
            if (JSON_getint(rcv_json,"A0", &a0)) msg.name[0] = a0;
            if (JSON_getint(rcv_json,"A1", &a0)) msg.name[1] = a0;
            if (JSON_getint(rcv_json,"A2", &a0)) msg.name[2] = a0;
            if (JSON_getint(rcv_json,"A3", &a0)) msg.name[3] = a0;
            if (JSON_getint(rcv_json,"A4", &a0)) msg.name[4] = a0;
            if (JSON_getint(rcv_json,"A5", &a0)) msg.name[5] = a0;
            if (JSON_getint(rcv_json,"A6", &a0)) msg.name[6] = a0;  
            xQueueSend(searchQueue, (void *)&msg, pdMS_TO_TICKS(10));
        }

        if (strcmp(command,"search")==0) {
           char *stat = (char *)calloc(1,25);    
           JSON_getstring(rcv_json,"stat", stat,25);
           if (strcmp(stat,"start")==0) {
               xEventGroupSetBits(searchGROUP, BIT_START);
           }
           if (strcmp(stat,"stop")==0) {
               printf("stop serbest bırakılıyor\n");
               xEventGroupSetBits(searchGROUP, BIT_STOP);
           }
           free(stat);
        }
        if (strcmp(command,"instance")==0) {
            ESP_LOGI("UART","%s",buf);
            uint8_t adr =255, id=255, type=255, chn=255, act=0x00;
            JSON_getint(rcv_json,"adr",&adr);
            JSON_getint(rcv_json,"id",&id);
            JSON_getint(rcv_json,"type",&type);
            JSON_getint(rcv_json,"chn",&chn);
            JSON_getint(rcv_json,"act",&act);
            //Bilgileri diske kaydet
            instance_t ins = {};
            instance.bosalt(&ins);
            ins.dev_addr = adr;
            ins.ins_addr = id;
            ins.channel = chn;
            ins.type = type;
            ins.ins_active = act;
            ins.status = 0;
            instance.add(&ins);
           // printf("   INS ADR : %d ID : %d TYPE : %d CHN:%d\n",adr, id,type,chn);
        }

        if (strcmp(command,"device")==0) {
            ESP_LOGI("UART","%s",buf);

            uint32_t rnd = 0;
            uint8_t adr =255, type=255, exttype=255, ins=255, chn=255;
            JSON_getlong(rcv_json,"rnd",&rnd);
            JSON_getint(rcv_json,"adr",&adr);
            JSON_getint(rcv_json,"type",&type);
            JSON_getint(rcv_json,"ext",&exttype);
            JSON_getint(rcv_json,"ins",&ins);
            JSON_getint(rcv_json,"chn",&chn);
            //Bilgileri diske kaydet
            searchMessage_t msg = {};
            gear_t gr = {};
            gr.aktif = 1;
            gr.short_addr = adr;
            gr.random_addr = rnd;
            gr.type = type;
            gr.ext_type = exttype;
            gr.kanal = (dev_sourge_t)chn;
            gr.instance = ins;
            gr.ico = 0;
            gr.room = 0xFF;   
            gr.anahtar=0xff;        
            gr.spec.status = 0;
            gr.spec.group[0] = 0;
            gr.spec.group[1] = 0;

            printf("ADR : %d TYPE : %d EXT : %d\n",adr, type,exttype);

            char *txt;
            char *harf;
            if (chn==1) asprintf(&harf,"A%02d",gr.short_addr);
            if (chn==2) asprintf(&harf,"B%02d",gr.short_addr);
            if (chn==3) asprintf(&harf,"C%02d",gr.short_addr);
            uint8_t fnd = 0;
            if (type==0x06) {asprintf(&txt,"Lamba%s",harf);fnd=1;} 
            if (type==0x08 ) {asprintf(&txt,"Rgb%s",harf); fnd=1;}
            if (type==0x07 && exttype==0x07) {asprintf(&txt,"Role%s",harf);fnd=1;} 
            if (type==0x07 && exttype==0x0B) {asprintf(&txt,"Anahtar%s",harf); fnd=1;}
            if (type==0x07 && exttype==0x77) {asprintf(&txt,"Perde%s",harf); fnd=1;}
            //else asprintf(&txt,"Btn%s",harf); 

            if (fnd==0) asprintf(&txt,"Bilinmeyen%s",harf);

            strcpy((char*)gr.name,txt);
            strcpy((char*)msg.name,txt);
            free(harf);
            free(txt);

            if (chn==1) gear01.update_gear(adr,&gr);
            if (chn==2) gear02.update_gear(adr,&gr);
            if (chn==3) gear03.update_gear(adr,&gr);

            
            msg.addr = adr;
            msg.type = type;
            msg.exttype = exttype;            
            xEventGroupSetBits(searchGROUP, BIT_CONTINUE);
            xQueueSend(searchQueue, (void *)&msg, pdMS_TO_TICKS(10));
        }
        free(command);
        cJSON_Delete(rcv_json);
    }
    
    
   // ESP_LOGI("UART","%s",buf);
    free(buf);
}

// Yeni görev: ReliableUartManager'ın zaman aşımı kontrollerini periyodik olarak çalıştırır
void reliable_uart_monitor_task(void *pvParameters) {
    UartDma* uart_instance = static_cast<UartDma*>(pvParameters);
    for (;;) {
        reliableUartManager.check_timeouts(uart_instance);
        vTaskDelay(pdMS_TO_TICKS(100)); // Her 100ms'de bir kontrol et
    }
}



void term_tara_task(void *pvParameters) 
{
    //Termostatları TARA
    vTaskDelay(10000/portTICK_PERIOD_MS);

    instance_t ff={};
    for (int i=0;i<MAX_INSTANCE;i++)
    {       
        disk.read_file(INSTANCE_FILE,&ff,sizeof(instance_t),i); 
        if (ff.dev_addr!=0xFF) {
            if (ff.type==0x06 && ff.ins_active>0) {
                //Bu Aktif bir termostattır
                //Once ısı okumasını isteyecegiz sonra da degerlendirmesi yapılacak
                printf("Term %d:%d\n",ff.dev_addr,ff.ins_addr);
             
                //Isısını istedik
                uint32_t cmm = (((ff.dev_addr<<1)|1) << 16)| (ff.ins_addr<<8) | (0xBC) ; 
                char *mm;
                asprintf(&mm,"%06lX:18:01:%02X#",cmm,ff.channel);
                myUart->send(mm);
                free(mm);

                searchMessage_t msg = {};
                xQueueReset(searchQueue);
                xQueueReceive(searchQueue, &msg, pdMS_TO_TICKS(5000));
                ff.temp = msg.name[0]; 

                xTaskCreatePinnedToCore(
                        process_and_control_task,           // Task fonksiyonunun adı
                        "pevptask",          // Task'ın ismi (debug için)
                        4096,               // Stack büyüklüğü artırıldı
                        &ff,               // Task'a kopyalanan parametre gönderiliyor
                        1,                  // Öncelik sırası (0 en düşük)
                        NULL,               // Task handle (referans gerekmiyorsa NULL)
                        1                   // Çalışacağı çekirdek (0 veya 1)
                    );

               
