ikorana/dali-ana-kutu02-esp32/main/main.cpp
            }
        }
    }
    vTaskDelete(NULL);
}

void led_task(void *pvParameters) 
{
   bool cnt=0;
   if (Network_Status!=ESP_OK || Active_Network_connection==3) {
       //Eğer ağ kurulamadıysa LED hızlı yanıp sönsün
       while(1) {
          gpio_set_level(LED, cnt);
          cnt=!cnt;
          vTaskDelay(100/portTICK_PERIOD_MS);
       }
   }

    //Ağ kurulduysa LED yavaş yanıp sönecek
   
        uint8_t ping_counter=0; 
        while(1) {
            gpio_set_level(LED,0);
            

            if (GlobalConfig.ping_active==1)
            {
                    uint8_t wcounter=0;
                    while(1) {
                        gpio_set_level(STM_PING, 0);
                        vTaskDelay(2/portTICK_PERIOD_MS);
                        if (gpio_get_level(STM_PONG)==0) {
                            ping_counter=0;
                            break;
                        }
                        gpio_set_level(STM_PING, 1);
                        vTaskDelay(2/portTICK_PERIOD_MS);
                        if (++wcounter>2) {
                            ping_counter++;
                            break;
                        }
                    }
                    if (ping_counter>4) {
                                //STM RESET
                                //Resetlemek için STM_RESET pini 1 yapılacak
                                ping_counter=0;
                                gpio_set_level(STM_RESET, 1);
                                vTaskDelay(10/portTICK_PERIOD_MS);
                                gpio_set_level(STM_RESET, 0);
                                ESP_LOGE(TAG,"STM Cevap vermiyor RESETLENDI");
                    }
      }

      if (stm_send_status==false) {
            cJSON *root = cJSON_CreateObject();                      
            cJSON_AddStringToObject(root, "com", "stm_status");
            cJSON_AddNumberToObject(root, "ping", GlobalConfig.ping_active); 
        
            send_STM(root);
            ESP_LOGI(TAG,"STM ye durum bildirildi");
        } 

      vTaskDelay(2800/portTICK_PERIOD_MS);
      gpio_set_level(LED,1);
      vTaskDelay(100/portTICK_PERIOD_MS);
    }
   
}


void initialise_mdns(void)
{
    // 1. mDNS Servisini Başlat
    esp_err_t err = mdns_init();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "mDNS başlatılamadı: %s", esp_err_to_name(err));
        return;
    }

    // 2. Cihazın Hostname'ini ayarla (Örn: akillihome.local)
    ESP_ERROR_CHECK(mdns_hostname_set("SMQMAIN"));
    ESP_LOGI(TAG, "mdns hostname ayarlandı: SMQMAIN.local");

    // 3. Cihazın varsayılan instance adını ayarla (İsteğe bağlı)
    ESP_ERROR_CHECK(mdns_instance_name_set("SmartQ Akilli Ev Kontrolcü"));

    // 4. Bir servis tanımla ve ağa duyur (Örn: Port 80 üzerinde çalışan bir HTTP web sunucusu)
    // Bu sayede Flutter uygulamaları veya mDNS tarayıcılar bu cihazı otomatik bulabilir.
    ESP_ERROR_CHECK(mdns_service_add("SMQMAIN_Web_Server", "_http", "_tcp", 80, NULL, 0));
    
    // İsteğe bağlı: Servise TXT kayıtları (metadata) ekleme
    mdns_txt_item_t serviceTxtData[2] = {
        {"board", "SMQMAIN"},
        {"version", "1.0.0"}
    };
    ESP_ERROR_CHECK(mdns_service_txt_set("_http", "_tcp", serviceTxtData, 2));
}

bool services_started = false;
void start_app_services() {
    if (services_started) return;
    if (Network_Status != ESP_OK) return;

    ESP_LOGI(TAG,"UDP Worker Start");
    // UDP İşleme Kuyruğu ve Taskı Oluşturuluyor
    udp_processing_queue = xQueueCreate(10, sizeof(udp_msg_t*));
    xTaskCreate(udp_worker_task, "udp_worker", 4096, NULL, 5, NULL);

    ESP_LOGI(TAG, "UDP Server (%d) Start Ediliyor",0xD002);
    udp_server.start(0xD002, &on_udp_message_received);

    ESP_LOGI(TAG, "Network VAR..");
    ESP_LOGI(TAG, "OTA server (79) ve TFTP server (69) start ediliyor");
    ota_server.ota_start(false);
    disk_server.disk_start(false);

    initialise_mdns();

    strcpy((char*)GlobalConfig.version,desc->version);    

    if (GlobalConfig.http_start==1)
    {
        ESP_LOGI(TAG, "Web server (80) start ediliyor");
        httpd.init("/config", httpd_replace_func,httpd_handler,true,false);
        httpd.start();
    } 

    if (Active_Network_connection>0 && Active_Network_connection<3) mqtt_start();
    
    stop_flash(); // LED animasyonunu durdur
    services_started = true;
    ESP_LOGI(TAG, "Tum ag servisleri baslatildi.");
    if (GlobalConfig.alarm==0) ESP_LOGW(TAG,"ALARM Kapalı");
    if (GlobalConfig.alarm==2) ESP_LOGE(TAG,"ALARM KURULU...");

    if (Active_Network_connection>0 && Active_Network_connection<3) {
        query_dns("smartq.com.tr");
        xTaskCreatePinnedToCore(
                        firebase_register_task,           // Task fonksiyonunun adı
                        "fbtask",          // Task'ın ismi (debug için)
                         8192,               // Stack büyüklüğü artırıldı
                        NULL,               // Task'a kopyalanan parametre gönderiliyor
                        1,                  // Öncelik sırası (0 en düşük)
                        NULL,               // Task handle (referans gerekmiyorsa NULL)
                        1                   // Çalışacağı çekirdek (0 veya 1)
                    );       
    } 

    //Cihazlar ilklendiriliyor
    for (Base_Device* cihaz : cihaz_listesi) {
            cihaz->init();
    } 


}

extern "C" void app_main()
{
    ESP_LOGI(TAG,"Program Initializing...");
    esp_event_loop_create_default();
    ESP_ERROR_CHECK(nvs_flash_init());
    ESP_LOGI(TAG, "NVS Flash Initialized.");
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_LOGI(TAG, "ESP Netif Initialized.");

    file_initialize();
    if (NetworkConfig.mac_chg==1)
    {
        NetworkConfig.mac_chg = 0;
        disk.write_file(NETWORK_FILE,&NetworkConfig,sizeof(NetworkConfig),0);
    }
    if (GlobalConfig.disk_format==1)
    {
        GlobalConfig.disk_format = 0;
        disk.write_file(GLOBAL_FILE,&GlobalConfig,sizeof(GlobalConfig),0);
    }


    start_network_manager(); 

    if (myUart->begin(STM_RX, STM_TX, 460800) == ESP_OK) {
        myUart->set_Callback(uartCallback);
        ESP_LOGI(TAG, "UART DMA Aktif");       
        // Dinlemeyi başlat (Arka plan task'ı oluşturulur)
        myUart->startListening();
    } 
    
