ikorana/dali-ana-kutu02-esp32/main/main.cpp
    // Reliable UART izleme görevini başlat
    xTaskCreatePinnedToCore(
        reliable_uart_monitor_task,
        "reliable_uart_mon",
        4096, // Stack boyutu
        myUart, // myUart örneğini göreve parametre olarak geçir
        10,   // Öncelik
        NULL,
        1     // Çekirdek
    );

    ESP_LOGI(TAG, "\nSTARTED SYSTEM...");

    Local_Device_Read();

    if (GlobalConfig.sulama) {
        Local_irrigation_Read();
    }

    if (GlobalConfig.sulama) {
        Local_lighting_Read();
    }



    xTaskCreatePinnedToCore(
                        term_tara_task,           // Task fonksiyonunun adı
                        "evptask",          // Task'ın ismi (debug için)
                        4096,               // Stack büyüklüğü artırıldı
                        NULL,               // Task'a kopyalanan parametre gönderiliyor
                        1,                  // Öncelik sırası (0 en düşük)
                        NULL,               // Task handle (referans gerekmiyorsa NULL)
                        1                   // Çalışacağı çekirdek (0 veya 1)
                    );
    
    strcpy((char*)GlobalConfig.version,desc->version);

    ESP_LOGI(TAG, "      SMARTQ DAli Home Controller");
    ESP_LOGI(TAG, "      ======================================================");
    ESP_LOGI(TAG, "             Version %s", desc->version);
    ESP_LOGI(TAG, "        Dali Version %s", "STM_V1.00");
    ESP_LOGI(TAG, "        Project Name %s", desc->project_name);
    ESP_LOGI(TAG, "             Compile %s %s", desc->date, desc->time);
    ESP_LOGI(TAG, "                 IDF %s", desc->idf_ver);    
    ESP_LOGI(TAG, "             Wifi is %s", (NetworkConfig.wan_type==WAN_WIFI)?"ON":"OFF");
    ESP_LOGI(TAG, "         Ethernet is %s", (NetworkConfig.wan_type==WAN_ETHERNET)?"ON":"OFF");    
    ESP_LOGI(TAG, "                  IP %s", (char*)NetworkConfig.ip);
    ESP_LOGI(TAG, "             Netmask %s", (char*)NetworkConfig.netmask);
    ESP_LOGI(TAG, "           MDns Host %s", (char*)NetworkConfig.dns);
    ESP_LOGI(TAG, "        Mqtt Broaker %s", (char*)GlobalConfig.mqtt);
    ESP_LOGI(TAG, "             License %s", (char*)GlobalConfig.license);
    ESP_LOGI(TAG, "               Admin %s", (char*)GlobalConfig.admin);
    ESP_LOGI(TAG, "             Kanal 1 %s", (GlobalConfig.kanal1)?"ON":"OFF");
    ESP_LOGI(TAG, "             Kanal 2 %s", (GlobalConfig.kanal2)?"ON":"OFF");
    ESP_LOGI(TAG, "             Kanal 3 %s", (GlobalConfig.kanal3)?"ON":"OFF");
    ESP_LOGI(TAG, "     Dali Wifi Kanal %s", (GlobalConfig.kanal4)?"ON":"OFF");
    ESP_LOGI(TAG, "          Active WAN %d", Active_Network_connection);
    ESP_LOGI(TAG, "             Bina NO %d", GlobalConfig.binaNo);
    ESP_LOGI(TAG, "              Kat NO %d", GlobalConfig.katNo);
    ESP_LOGI(TAG, "            Daire NO %d", GlobalConfig.daireNo);

    ESP_LOGI(TAG, "      Sulama Sistemi %s", (GlobalConfig.sulama)?"AÇIK":"KAPALI");
    ESP_LOGI(TAG, "    Çevre Aydınlatma %s", (GlobalConfig.aydinlatma)?"AÇIK":"KAPALI");
    ESP_LOGI(TAG, "      ======================================================");


    if (Network_Status!=ESP_OK) {
        ESP_LOGE(TAG,"NETWORK YOK...");

    }

    if (GlobalConfig.alarm_aktif==1) ESP_LOGE(TAG,"AKTIF ALARM VAR");

    


    xTaskCreatePinnedToCore(
                        led_task,           // Task fonksiyonunun adı
                        "etask",          // Task'ın ismi (debug için)
                        2048,               // Stack büyüklüğü artırıldı
                        NULL,               // Task'a kopyalanan parametre gönderiliyor
                        1,                  // Öncelik sırası (0 en düşük)
                        NULL,               // Task handle (referans gerekmiyorsa NULL)
                        1                   // Çalışacağı çekirdek (0 veya 1)
                    );


    xTaskCreatePinnedToCore(dakika_task, "dakika_tetikleme_task", 3072, NULL, 5, NULL, 1);                
             
    while(1)
    {       
        vTaskDelay(10/portTICK_PERIOD_MS);
    }


}
